In [4]:
!pip install pysqlite3

Collecting pysqlite3
  Using cached pysqlite3-0.5.1.tar.gz (40 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Building wheels for collected packages: pysqlite3
  Building wheel for pysqlite3 (setup.py): started
  Building wheel for pysqlite3 (setup.py): finished with status 'error'
  Running setup.py clean for pysqlite3
Failed to build pysqlite3

  error: subprocess-exited-with-error

  × python setup.py bdist_wheel did not run successfully.
  │ exit code: 1
  ╰─> [12 lines of output]
      running bdist_wheel
      running build
      running build_py
      creating build
      creating build\lib.win-amd64-cpython-38
      creating build\lib.win-amd64-cpython-38\pysqlite3
      copying pysqlite3\dbapi2.py -> build\lib.win-amd64-cpython-38\pysqlite3
      copying pysqlite3\__init__.py -> build\lib.win-amd64-cpython-38\pysqlite3
      running build_ext
      Builds a C extension linking against libsqlite3 library
      building 'pysqlite3._sqlite3' extension
      error: Microsoft Visual C++ 14.0 or greater is required. Get it with "Microsoft C++ Build Tools": https://visualstudio.microsoft.com/visual-cpp-build-tools/
      [end of output]

  note: This error originates from a subprocess, and is likely not a problem with pip.
  ERROR: Failed building wheel for pysqlite3
ERROR: Could not build wheels for pysqlite3, which is required to install pyproject.toml-based projects

## 일반적인 방법[SQLITE]

In [5]:
import sqlite3

conn = sqlite3.connect('chinook.db')
c = conn.cursor()

query = ''' select *
from albums'''

c.execute(query)

In [6]:
print(c.fetchone())

(1, 'For Those About To Rock We Salute You', 1)

In [7]:
c.close()
conn.close()

## 판다스로 가져오기[SQLITE]

In [8]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('chinook.db')
c = conn.cursor()

query = ''' select *
from albums'''

c.execute(query)

c = conn.cursor()

query = ''' select *
from albums'''

df = pd.read_sql(query, conn)
df.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [9]:
!pip install psycopg2
!pip install sqlalchemy

Requirement already satisfied: psycopg2 in c:\users\sba\anaconda3\envs\ai2\lib\site-packages (2.9.7)
Requirement already satisfied: sqlalchemy in c:\users\sba\anaconda3\envs\ai2\lib\site-packages (2.0.20)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\sba\anaconda3\envs\ai2\lib\site-packages (from sqlalchemy) (4.7.1)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\sba\anaconda3\envs\ai2\lib\site-packages (from sqlalchemy) (2.0.2)

In [10]:
import psycopg2, sqlalchemy
db_params = {'host': 'localhost',
            'database' : 'postgres',
            'user' : 'postgres', 
            'password' : '0000',
            'port': '5432'}

In [11]:
try:
    conn = psycopg2.connect(**db_params)
    cursor = conn.cursor()
    print('데이터베이스 연결 성공')
    create_table_query = 'CREATE TABLE IF NOT EXISTS example_table (id SERIAL PRIMARY KEY, data VARCHAR)'
    insert_data_query = "INSERT INTO example_table (data) VALUES ('HI')"
    cursor.execute(create_table_query)
    cursor.execute(insert_data_query)
    conn.commit()
    read_data_query = 'select * from example_table'
    cursor.execute(read_data_query)
    print(cursor.fetchall())
    print('테이블 생성 완료')

except:



    print(error)
finally:
    if conn:
        conn.close()
        print("데이터베이스 연결 종료")

데이터베이스 연결 성공
[(1, 'HI'), (2, 'HI'), (3, 'HI'), (4, 'HI'), (5, 'HI'), (6, 'HI'), (7, 'HI'), (8, 'HI'), (9, 'HI'), (10, 'HI'), (11, 'HI'), (12, 'HI'), (13, 'HI'), (14, 'HI'), (15, 'HI'), (16, 'HI'), (17, 'HI'), (18, 'HI'), (19, 'HI')]
테이블 생성 완료
데이터베이스 연결 종료

In [12]:
db_cha = {'host': 'floppy.db.elephantsql.com',
            'database' : 'tibzgxay',
            'user' : 'tibzgxay', 
            'password' : 'AYCRLjTB-k-cNsFUkrz81uGm6USM59WW',
            'port': '5432'}

try:
    conn1 = psycopg2.connect(**db_cha)
    cursor = conn1.cursor()
    print('데이터베이스 연결 성공')
    create_table_query = 'CREATE TABLE IF NOT EXISTS example_table (id SERIAL PRIMARY KEY, data VARCHAR)'
    insert_data_query = "INSERT INTO example_table (data) VALUES ('HI')"
    cursor.execute(create_table_query)
    cursor.execute(insert_data_query)
    conn1.commit()
    read_data_query = 'select * from example_table'
    cursor.execute(read_data_query)
    print(cursor.fetchall())
    print('테이블 생성 완료')

except:



    print(error)
finally:
    if conn:
        conn.close()
        print("데이터베이스 연결 종료")

데이터베이스 연결 성공
[(1, 'HI'), (2, 'HI'), (3, 'HI'), (4, 'HI'), (5, 'HI')]
테이블 생성 완료
데이터베이스 연결 종료

In [13]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/jin0choi1216/dataset/main/AAPL.csv')
df.head(3)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2012-01-03,14.621429,14.732143,14.607143,14.686786,12.466090,302220800
1,2012-01-04,14.642857,14.810000,14.617143,14.765714,12.533089,260022000
2,2012-01-05,14.819643,14.948214,14.738214,14.929643,12.672229,271269600

In [14]:
import psycopg2
from sqlalchemy import create_engine

db_params = {'host': 'localhost',
            'database' : 'postgres',
            'user' : 'postgres', 
            'password' : '0000',
            'port': '5432'}

try:
    conn = psycopg2.connect(**db_params)
    cursor = conn.cursor()
    engine = create_engine('postgresql://postgres:0000@localhost/postgres')
    print("데이터베이스 연결 성공")
    with engine.connect() as con:
        df.to_sql('aapl', con, if_exists = 'replace')
except (Exception, psycopg2.Error) as error:
    print(error)
finally:
    if conn:
        conn.close()
        print("데이터베이스 연결 종료")

데이터베이스 연결 성공
데이터베이스 연결 종료

In [15]:
import psycopg2
from sqlalchemy import create_engine

db_params = {'host': 'localhost',
            'database' : 'postgres',
            'user' : 'postgres', 
            'password' : '0000',
            'port': '5432'}

try:
    conn = psycopg2.connect(**db_params)
    cursor = conn.cursor()
    engine = create_engine('postgresql://postgres:0000@localhost/postgres')
    print("데이터베이스 연결 성공")
    with engine.connect() as con:
        aapl = pd.read_sql('select * from aapl', con)
except (Exception, psycopg2.Error) as error:
    print(error)
finally:
    if conn:
        conn.close()
        print("데이터베이스 연결 종료")

데이터베이스 연결 성공
데이터베이스 연결 종료

In [16]:
aapl.head()

,index,Date,Open,High,Low,Close,Adj Close,Volume
0,0,2012-01-03,14.621429,14.732143,14.607143,14.686786,12.466090,302220800
1,1,2012-01-04,14.642857,14.810000,14.617143,14.765714,12.533089,260022000
2,2,2012-01-05,14.819643,14.948214,14.738214,14.929643,12.672229,271269600
3,3,2012-01-06,14.991786,15.098214,14.972143,15.085714,12.804703,318292800
4,4,2012-01-09,15.196429,15.276786,15.048214,15.061786,12.784389,394024400

In [17]:
import pandas as pd

data = [10, 20, 30, 40, 50]
s = pd.Series(data)

print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64